###################################################################

# Created by write_sdc on Sun Nov  9 03:08:26 2025

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_max_fanout 16 [current_design]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__id__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__id__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__id__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__id__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__63_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__62_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__61_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__60_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__59_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__58_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__57_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__56_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__55_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__54_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__53_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__52_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__51_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__50_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__49_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__48_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__47_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__46_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__45_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__44_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__43_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__42_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__41_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__40_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__39_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__38_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__37_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__36_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__35_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__34_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__33_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__32_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__31_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__30_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__29_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__28_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__27_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__26_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__25_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__24_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__23_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__22_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__21_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__20_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__19_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__18_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__17_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__16_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__15_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__14_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__13_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__12_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__11_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__10_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__9_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__8_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__7_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__6_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__5_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__4_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__addr__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__len__7_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__len__6_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__len__5_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__len__4_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__len__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__len__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__len__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__len__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__size__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__size__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__size__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__burst__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__burst__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__lock_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__cache__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__cache__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__cache__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__cache__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__prot__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__prot__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__prot__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__qos__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__qos__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__qos__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__qos__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__region__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__region__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__region__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__region__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__atop__5_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__atop__4_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__atop__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__atop__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__atop__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__atop__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw__user__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_aw_valid_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__63_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__62_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__61_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__60_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__59_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__58_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__57_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__56_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__55_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__54_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__53_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__52_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__51_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__50_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__49_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__48_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__47_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__46_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__45_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__44_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__43_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__42_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__41_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__40_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__39_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__38_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__37_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__36_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__35_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__34_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__33_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__32_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__31_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__30_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__29_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__28_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__27_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__26_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__25_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__24_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__23_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__22_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__21_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__20_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__19_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__18_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__17_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__16_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__15_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__14_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__13_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__12_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__11_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__10_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__9_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__8_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__7_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__6_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__5_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__4_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__data__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__strb__7_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__strb__6_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__strb__5_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__strb__4_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__strb__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__strb__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__strb__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__strb__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__last_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w__user__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_w_valid_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_b_ready_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__id__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__id__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__id__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__id__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__63_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__62_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__61_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__60_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__59_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__58_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__57_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__56_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__55_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__54_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__53_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__52_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__51_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__50_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__49_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__48_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__47_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__46_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__45_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__44_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__43_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__42_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__41_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__40_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__39_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__38_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__37_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__36_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__35_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__34_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__33_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__32_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__31_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__30_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__29_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__28_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__27_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__26_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__25_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__24_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__23_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__22_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__21_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__20_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__19_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__18_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__17_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__16_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__15_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__14_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__13_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__12_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__11_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__10_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__9_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__8_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__7_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__6_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__5_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__4_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__addr__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__len__7_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__len__6_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__len__5_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__len__4_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__len__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__len__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__len__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__len__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__size__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__size__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__size__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__burst__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__burst__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__lock_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__cache__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__cache__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__cache__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__cache__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__prot__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__prot__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__prot__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__qos__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__qos__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__qos__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__qos__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__region__3_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__region__2_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__region__1_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__region__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar__user__0_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_ar_valid_]
set_load -pin_load 0.005 [get_ports cva6_axi_req_o_r_ready_]
set_ideal_network [get_ports rst_ni]
create_clock [get_ports clk_i]  -period 5000  -waveform {0 2500}
set_clock_uncertainty 250  [get_clocks clk_i]
set_clock_transition -max -rise 250 [get_clocks clk_i]
set_clock_transition -max -fall 250 [get_clocks clk_i]
set_clock_transition -min -rise 250 [get_clocks clk_i]
set_clock_transition -min -fall 250 [get_clocks clk_i]
set_input_delay -clock clk_i  -max 1000  [get_ports rst_ni]
set_input_delay -clock clk_i  -min 500  [get_ports rst_ni]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_aw_ready_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_aw_ready_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_ar_ready_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_ar_ready_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_w_ready_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_w_ready_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_b_valid_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_b_valid_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_b__id__3_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_b__id__3_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_b__id__2_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_b__id__2_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_b__id__1_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_b__id__1_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_b__id__0_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_b__id__0_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_b__resp__1_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_b__resp__1_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_b__resp__0_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_b__resp__0_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_b__user__0_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_b__user__0_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r_valid_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r_valid_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__id__3_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__id__3_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__id__2_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__id__2_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__id__1_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__id__1_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__id__0_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__id__0_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__63_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__63_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__62_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__62_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__61_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__61_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__60_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__60_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__59_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__59_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__58_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__58_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__57_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__57_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__56_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__56_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__55_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__55_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__54_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__54_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__53_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__53_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__52_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__52_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__51_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__51_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__50_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__50_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__49_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__49_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__48_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__48_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__47_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__47_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__46_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__46_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__45_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__45_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__44_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__44_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__43_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__43_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__42_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__42_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__41_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__41_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__40_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__40_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__39_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__39_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__38_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__38_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__37_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__37_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__36_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__36_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__35_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__35_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__34_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__34_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__33_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__33_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__32_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__32_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__31_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__31_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__30_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__30_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__29_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__29_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__28_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__28_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__27_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__27_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__26_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__26_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__25_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__25_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__24_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__24_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__23_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__23_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__22_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__22_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__21_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__21_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__20_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__20_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__19_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__19_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__18_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__18_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__17_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__17_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__16_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__16_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__15_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__15_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__14_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__14_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__13_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__13_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__12_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__12_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__11_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__11_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__10_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__10_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__9_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__9_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__8_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__8_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__7_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__7_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__6_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__6_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__5_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__5_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__4_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__4_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__3_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__3_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__2_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__2_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__1_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__1_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__data__0_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__data__0_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__resp__1_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__resp__1_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__resp__0_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__resp__0_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__last_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__last_]
set_input_delay -clock clk_i  -max 1000  [get_ports cva6_axi_resp_i_r__user__0_]
set_input_delay -clock clk_i  -min 500  [get_ports cva6_axi_resp_i_r__user__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__id__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__id__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__id__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__id__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__id__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__id__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__id__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__id__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__63_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__63_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__62_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__62_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__61_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__61_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__60_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__60_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__59_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__59_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__58_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__58_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__57_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__57_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__56_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__56_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__55_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__55_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__54_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__54_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__53_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__53_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__52_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__52_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__51_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__51_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__50_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__50_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__49_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__49_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__48_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__48_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__47_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__47_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__46_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__46_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__45_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__45_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__44_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__44_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__43_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__43_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__42_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__42_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__41_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__41_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__40_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__40_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__39_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__39_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__38_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__38_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__37_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__37_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__36_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__36_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__35_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__35_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__34_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__34_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__33_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__33_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__32_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__32_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__31_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__31_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__30_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__30_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__29_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__29_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__28_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__28_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__27_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__27_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__26_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__26_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__25_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__25_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__24_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__24_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__23_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__23_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__22_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__22_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__21_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__21_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__20_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__20_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__19_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__19_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__18_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__18_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__17_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__17_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__16_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__16_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__15_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__15_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__14_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__14_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__13_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__13_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__12_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__12_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__11_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__11_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__10_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__10_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__9_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__9_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__8_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__8_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__7_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__7_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__6_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__6_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__5_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__5_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__4_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__4_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__addr__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__addr__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__len__7_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__len__7_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__len__6_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__len__6_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__len__5_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__len__5_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__len__4_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__len__4_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__len__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__len__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__len__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__len__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__len__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__len__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__len__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__len__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__size__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__size__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__size__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__size__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__size__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__size__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__burst__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__burst__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__burst__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__burst__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__lock_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__lock_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__cache__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__cache__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__cache__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__cache__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__cache__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__cache__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__cache__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__cache__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__prot__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__prot__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__prot__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__prot__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__prot__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__prot__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__qos__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__qos__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__qos__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__qos__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__qos__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__qos__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__qos__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__qos__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__region__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__region__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__region__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__region__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__region__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__region__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__region__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__region__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__atop__5_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__atop__5_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__atop__4_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__atop__4_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__atop__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__atop__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__atop__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__atop__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__atop__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__atop__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__atop__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__atop__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw__user__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw__user__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_aw_valid_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_aw_valid_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__63_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__63_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__62_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__62_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__61_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__61_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__60_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__60_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__59_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__59_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__58_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__58_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__57_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__57_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__56_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__56_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__55_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__55_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__54_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__54_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__53_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__53_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__52_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__52_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__51_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__51_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__50_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__50_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__49_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__49_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__48_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__48_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__47_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__47_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__46_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__46_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__45_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__45_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__44_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__44_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__43_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__43_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__42_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__42_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__41_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__41_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__40_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__40_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__39_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__39_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__38_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__38_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__37_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__37_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__36_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__36_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__35_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__35_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__34_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__34_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__33_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__33_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__32_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__32_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__31_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__31_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__30_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__30_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__29_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__29_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__28_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__28_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__27_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__27_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__26_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__26_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__25_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__25_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__24_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__24_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__23_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__23_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__22_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__22_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__21_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__21_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__20_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__20_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__19_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__19_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__18_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__18_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__17_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__17_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__16_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__16_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__15_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__15_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__14_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__14_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__13_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__13_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__12_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__12_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__11_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__11_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__10_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__10_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__9_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__9_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__8_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__8_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__7_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__7_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__6_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__6_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__5_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__5_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__4_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__4_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__data__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__data__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__strb__7_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__strb__7_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__strb__6_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__strb__6_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__strb__5_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__strb__5_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__strb__4_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__strb__4_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__strb__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__strb__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__strb__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__strb__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__strb__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__strb__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__strb__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__strb__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__last_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__last_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w__user__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w__user__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_w_valid_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_w_valid_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_b_ready_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_b_ready_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__id__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__id__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__id__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__id__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__id__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__id__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__id__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__id__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__63_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__63_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__62_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__62_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__61_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__61_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__60_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__60_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__59_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__59_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__58_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__58_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__57_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__57_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__56_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__56_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__55_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__55_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__54_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__54_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__53_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__53_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__52_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__52_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__51_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__51_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__50_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__50_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__49_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__49_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__48_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__48_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__47_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__47_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__46_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__46_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__45_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__45_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__44_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__44_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__43_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__43_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__42_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__42_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__41_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__41_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__40_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__40_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__39_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__39_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__38_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__38_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__37_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__37_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__36_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__36_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__35_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__35_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__34_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__34_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__33_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__33_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__32_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__32_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__31_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__31_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__30_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__30_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__29_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__29_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__28_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__28_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__27_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__27_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__26_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__26_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__25_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__25_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__24_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__24_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__23_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__23_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__22_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__22_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__21_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__21_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__20_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__20_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__19_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__19_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__18_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__18_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__17_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__17_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__16_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__16_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__15_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__15_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__14_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__14_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__13_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__13_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__12_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__12_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__11_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__11_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__10_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__10_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__9_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__9_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__8_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__8_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__7_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__7_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__6_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__6_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__5_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__5_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__4_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__4_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__addr__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__addr__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__len__7_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__len__7_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__len__6_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__len__6_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__len__5_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__len__5_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__len__4_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__len__4_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__len__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__len__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__len__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__len__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__len__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__len__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__len__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__len__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__size__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__size__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__size__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__size__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__size__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__size__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__burst__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__burst__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__burst__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__burst__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__lock_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__lock_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__cache__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__cache__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__cache__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__cache__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__cache__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__cache__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__cache__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__cache__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__prot__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__prot__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__prot__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__prot__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__prot__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__prot__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__qos__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__qos__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__qos__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__qos__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__qos__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__qos__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__qos__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__qos__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__region__3_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__region__3_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__region__2_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__region__2_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__region__1_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__region__1_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__region__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__region__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar__user__0_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar__user__0_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_ar_valid_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_ar_valid_]
set_output_delay -clock clk_i  -max 1000  [get_ports cva6_axi_req_o_r_ready_]
set_output_delay -clock clk_i  -min 500  [get_ports cva6_axi_req_o_r_ready_]
set_input_transition -max 0.05  [get_ports clk_i]
set_input_transition -min 0.05  [get_ports clk_i]
set_input_transition -max 0.05  [get_ports rst_ni]
set_input_transition -min 0.05  [get_ports rst_ni]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_aw_ready_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_aw_ready_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_ar_ready_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_ar_ready_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_w_ready_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_w_ready_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_b_valid_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_b_valid_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_b__id__3_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_b__id__3_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_b__id__2_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_b__id__2_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_b__id__1_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_b__id__1_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_b__id__0_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_b__id__0_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_b__resp__1_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_b__resp__1_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_b__resp__0_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_b__resp__0_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_b__user__0_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_b__user__0_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r_valid_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r_valid_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__id__3_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__id__3_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__id__2_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__id__2_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__id__1_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__id__1_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__id__0_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__id__0_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__63_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__63_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__62_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__62_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__61_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__61_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__60_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__60_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__59_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__59_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__58_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__58_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__57_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__57_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__56_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__56_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__55_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__55_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__54_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__54_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__53_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__53_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__52_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__52_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__51_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__51_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__50_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__50_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__49_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__49_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__48_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__48_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__47_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__47_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__46_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__46_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__45_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__45_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__44_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__44_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__43_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__43_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__42_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__42_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__41_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__41_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__40_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__40_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__39_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__39_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__38_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__38_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__37_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__37_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__36_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__36_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__35_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__35_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__34_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__34_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__33_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__33_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__32_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__32_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__31_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__31_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__30_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__30_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__29_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__29_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__28_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__28_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__27_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__27_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__26_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__26_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__25_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__25_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__24_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__24_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__23_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__23_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__22_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__22_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__21_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__21_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__20_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__20_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__19_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__19_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__18_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__18_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__17_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__17_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__16_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__16_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__15_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__15_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__14_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__14_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__13_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__13_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__12_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__12_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__11_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__11_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__10_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__10_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__9_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__9_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__8_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__8_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__7_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__7_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__6_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__6_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__5_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__5_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__4_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__4_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__3_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__3_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__2_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__2_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__1_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__1_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__data__0_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__data__0_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__resp__1_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__resp__1_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__resp__0_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__resp__0_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__last_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__last_]
set_input_transition -max 0.05  [get_ports cva6_axi_resp_i_r__user__0_]
set_input_transition -min 0.05  [get_ports cva6_axi_resp_i_r__user__0_]
